## Plan Result (sbox_aria - Terraform Plan Apply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 24 to add, 14 to change, 2 to destroy.</code></pre>

* Create
  * azurerm_eventhub.aria_topic[&#34;00-ap-ack&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-ap-dl&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-ap-pub&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-bl-ack&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-bl-dl&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-bl-pub&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-joh-ack&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-joh-dl&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-joh-pub&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-td-ack&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-td-dl&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-td-pub&#34;]
  * azurerm_eventhub.aria_topic[&#34;02-ap-ack&#34;]
  * azurerm_eventhub.aria_topic[&#34;02-ap-dl&#34;]
  * azurerm_eventhub.aria_topic[&#34;02-ap-pub&#34;]
  * azurerm_eventhub.aria_topic[&#34;02-bl-ack&#34;]
  * azurerm_eventhub.aria_topic[&#34;02-bl-dl&#34;]
  * azurerm_eventhub.aria_topic[&#34;02-bl-pub&#34;]
  * azurerm_eventhub.aria_topic[&#34;02-joh-ack&#34;]
  * azurerm_eventhub.aria_topic[&#34;02-joh-dl&#34;]
  * azurerm_eventhub.aria_topic[&#34;02-joh-pub&#34;]
  * azurerm_eventhub.aria_topic[&#34;02-td-ack&#34;]
  * azurerm_eventhub.aria_topic[&#34;02-td-dl&#34;]
  * azurerm_eventhub.aria_topic[&#34;02-td-pub&#34;]
* Update
  * azurerm_linux_function_app.example[&#34;00-af-apflpa-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-apl-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-apluta-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-bails-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-joh-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-sbails-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-td-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-apflpa-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-apl-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-apluta-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-bails-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-joh-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-sbails-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-td-sbox-uks-dlrm-01&#34;]
* Delete
  * azurerm_eventhub.aria_topic[&#34;00&#34;]
  * azurerm_eventhub.aria_topic[&#34;02&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_eventhub.aria_topic["00"] will be destroyed
  # (because key ["00"] is not in for_each map)
  - resource "azurerm_eventhub" "aria_topic" {
      - id                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-sbox/eventhubs/test-evh-joh-dl-sbox-uks-dlrm-01" -> null
      - message_retention   = 1 -> null
      - name                = "test-evh-joh-dl-sbox-uks-dlrm-01" -> null
      - namespace_id        = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-sbox" -> null
      - namespace_name      = "ingest00-integration-eventHubNamespace001-sbox" -> null
      - partition_count     = 2 -> null
      - partition_ids       = [
          - "0",
          - "1",
        ] -> null
      - resource_group_name = "ingest00-main-sbox" -> null
      - status              = "Active" -> null
    }

  # azurerm_eventhub.aria_topic["00-ap-ack"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-ap-ack-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-ap-dl"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-ap-dl-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-ap-pub"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-ap-pub-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-bl-ack"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-bl-ack-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-bl-dl"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-bl-dl-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-bl-pub"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-bl-pub-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-joh-ack"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-joh-ack-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-joh-dl"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-joh-dl-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-joh-pub"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-joh-pub-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-td-ack"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-td-ack-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-td-dl"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-td-dl-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-td-pub"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-td-pub-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["02"] will be destroyed
  # (because key ["02"] is not in for_each map)
  - resource "azurerm_eventhub" "aria_topic" {
      - id                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.EventHub/namespaces/ingest02-integration-eventHubNamespace001-sbox/eventhubs/test-evh-joh-dl-sbox-uks-dlrm-01" -> null
      - message_retention   = 1 -> null
      - name                = "test-evh-joh-dl-sbox-uks-dlrm-01" -> null
      - namespace_id        = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.EventHub/namespaces/ingest02-integration-eventHubNamespace001-sbox" -> null
      - namespace_name      = "ingest02-integration-eventHubNamespace001-sbox" -> null
      - partition_count     = 2 -> null
      - partition_ids       = [
          - "0",
          - "1",
        ] -> null
      - resource_group_name = "ingest02-main-sbox" -> null
      - status              = "Active" -> null
    }

  # azurerm_eventhub.aria_topic["02-ap-ack"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-ap-ack-02-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest02-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest02-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["02-ap-dl"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-ap-dl-02-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest02-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest02-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["02-ap-pub"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-ap-pub-02-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest02-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest02-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["02-bl-ack"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-bl-ack-02-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest02-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest02-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["02-bl-dl"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-bl-dl-02-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest02-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest02-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["02-bl-pub"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-bl-pub-02-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest02-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest02-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["02-joh-ack"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-joh-ack-02-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest02-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest02-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["02-joh-dl"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-joh-dl-02-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest02-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest02-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["02-joh-pub"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-joh-pub-02-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest02-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest02-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["02-td-ack"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-td-ack-02-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest02-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest02-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["02-td-dl"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-td-dl-02-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest02-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest02-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["02-td-pub"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-td-pub-02-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest02-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest02-main-sbox"
      + status              = "Active"
    }

  # azurerm_linux_function_app.example["00-af-apflpa-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/00-af-apflpa-sbox-uks-dlrm-01"
        name                                           = "00-af-apflpa-sbox-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # azurerm_linux_function_app.example["00-af-apl-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/00-af-apl-sbox-uks-dlrm-01"
        name                                           = "00-af-apl-sbox-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # azurerm_linux_function_app.example["00-af-apluta-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/00-af-apluta-sbox-uks-dlrm-01"
        name                                           = "00-af-apluta-sbox-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # azurerm_linux_function_app.example["00-af-bails-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/00-af-bails-sbox-uks-dlrm-01"
        name                                           = "00-af-bails-sbox-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # azurerm_linux_function_app.example["00-af-joh-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/00-af-joh-sbox-uks-dlrm-01"
        name                                           = "00-af-joh-sbox-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # azurerm_linux_function_app.example["00-af-sbails-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/00-af-sbails-sbox-uks-dlrm-01"
        name                                           = "00-af-sbails-sbox-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # azurerm_linux_function_app.example["00-af-td-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/00-af-td-sbox-uks-dlrm-01"
        name                                           = "00-af-td-sbox-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # azurerm_linux_function_app.example["02-af-apflpa-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/02-af-apflpa-sbox-uks-dlrm-01"
        name                                           = "02-af-apflpa-sbox-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # azurerm_linux_function_app.example["02-af-apl-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/02-af-apl-sbox-uks-dlrm-01"
        name                                           = "02-af-apl-sbox-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # azurerm_linux_function_app.example["02-af-apluta-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/02-af-apluta-sbox-uks-dlrm-01"
        name                                           = "02-af-apluta-sbox-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # azurerm_linux_function_app.example["02-af-bails-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/02-af-bails-sbox-uks-dlrm-01"
        name                                           = "02-af-bails-sbox-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # azurerm_linux_function_app.example["02-af-joh-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/02-af-joh-sbox-uks-dlrm-01"
        name                                           = "02-af-joh-sbox-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # azurerm_linux_function_app.example["02-af-sbails-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/02-af-sbails-sbox-uks-dlrm-01"
        name                                           = "02-af-sbails-sbox-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # azurerm_linux_function_app.example["02-af-td-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/02-af-td-sbox-uks-dlrm-01"
        name                                           = "02-af-td-sbox-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

Plan: 24 to add, 14 to change, 2 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":16,"Program":"tfcmt","SHA1":"","Target":"sbox_aria - Terraform Plan Apply","Vars":{}} -->